app/views/welcome/products.html.erb

      <div class="stat-info">
        <h3 id="totalProducts"><%= Product.count %></h3>
---
SELECT COUNT(*) FROM "products"

      <div class="stat-info">
        <h3 id="totalCategories"><%= Product.distinct.count(:category) %></h3>
---
SELECT COUNT(DISTINCT "products"."category") FROM "products"

      <div class="stat-info">
        <h3 id="totalBrands"><%= Product.distinct.count(:brand) %></h3>
---
SELECT COUNT(*) FROM "products"