app/views/welcome/system_info.html.erb

SELECT COUNT(*) FROM "clicks"
---
              <% begin %>
                <%= number_with_delimiter(Click.count) %>