app/views/welcome/system_info.html.erb

              <% begin %>
                <%= number_with_delimiter(Click.count) %>
---
SELECT COUNT(*) FROM "clicks"