app/controllers/clicks_controller.rb

SELECT "clicks".* FROM "clicks" ORDER BY "clicks"."id" DESC LIMIT 1
UPDATE "clicks" SET "count" = 5, "updated_at" = '2026-01-20 21:38:51.866962' WHERE "clicks"."id" = 1
---
  def increment
    # Obtener el token de reCAPTCHA desde los parámetros
    recaptcha_response = params['g-recaptcha-response']

    # Validar reCAPTCHA
    unless verify_recaptcha(response: recaptcha_response)
      render json: {
        success: false,
        error: "Por favor, verifica que no eres un robot antes de continuar."
      }, status: :unprocessable_entity
      return
    end

    # Si reCAPTCHA es válido, proceder con la lógica normal
    click = Click.last || Click.create(count: 0)
    click.update(count: click.count + 1)

SELECT "clicks".* FROM "clicks" ORDER BY "clicks"."id" DESC LIMIT 1
---
  def total
    click = Click.last || Click.create(count: 0)