app/controllers/welcome_controller.rb

INSERT INTO "clicks" ("count", "created_at", "updated_at") VALUES (0, '2026-01-19 07:09:15.301189', '2026-01-19 07:09:15.301189') RETURNING "id"
SELECT "clicks".* FROM "clicks" ORDER BY "clicks"."id" DESC LIMIT 1
SELECT COUNT(*) FROM "clicks"
---
  def index
    @click = Click.last || Click.create(count: 0)
    @total_clicks = @click.count