app/controllers/welcome_controller.rb

SELECT "slides".* FROM "slides" ORDER BY "slides"."created_at" DESC
SELECT MIN("slides"."created_at") FROM "slides"
---
  def carousel
    @slides = Slide.all.order(created_at: :desc)

INSERT INTO "slides" ("title", "image", "position", "active", "created_at", "updated_at") VALUES ('2345t', NULL, NULL, NULL, '2026-03-01 05:59:59.641587', '2026-03-01 05:59:59.641587') RETURNING "id"
---
  def create_slide
    @slide = Slide.new(slide_params)

    if @slide.save

SELECT "slides".* FROM "slides" WHERE "slides"."id" = 0 LIMIT 1
DELETE FROM "slides" WHERE "slides"."id" = 7
---
  def destroy_slide
    @slide = Slide.find(params[:id])
    @slide.destroy

SELECT "questionnaires".* FROM "questionnaires" ORDER BY "questionnaires"."created_at" DESC
---
  def questionnaire_data
    @questionnaires = Questionnaire.all.order(created_at: :desc)

SELECT "questionnaires".* FROM "questionnaires" ORDER BY "questionnaires"."created_at" DESC
---
  def questionnaire_list
    @questionnaires = Questionnaire.all.order(created_at: :desc)

SELECT COUNT(*) FROM "products"
---
  def products
    @products = Product.order(created_at: :desc).page(params[:page]).per(5)

INSERT INTO "products" ("name", "category", "price", "brand", "created_at", "updated_at") VALUES ('Producto 1', 'Libros', 500.0, 'HP', '2026-02-24 06:40:05.678866', '2026-02-24 06:40:05.678866') RETURNING "id"
SELECT COUNT(*) FROM "products"
---
  def create_product
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
        @products = Product.order(created_at: :desc).page(params[:page]).per(5)

SELECT "products".* FROM "products" WHERE "products"."id" = 6 LIMIT 1
UPDATE "products" SET "price" = 1500.0, "updated_at" = '2026-02-24 06:54:56.373446' WHERE "products"."id" = 6
---
  def update_product
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update(product_params)

SELECT "products".* FROM "products" WHERE "products"."id" = 1 LIMIT 1
DELETE FROM "products" WHERE "products"."id" = 1
---
  def destroy_product
    @product = Product.find(params[:id])
    @product.destroy

SELECT "products".* FROM "products" ORDER BY "products"."created_at" DESC
---
  def product_data
    @products = Product.all.order(created_at: :desc)